{
  "backend/main.mo": "Empty actor definition with no implemented methods.",
  "feature_evidence.json": "Report listing three background‑music features with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file providing short descriptions of all frontend pages and romance components.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining light/dark themes and global styling.",
  "frontend/index.html": "Basic HTML document loading the React root and main entry script.",
  "frontend/src/App.tsx": "Configures TanStack Router with all pages and wraps routing in MusicProvider.",
  "frontend/src/components/romance/CountdownTimer.tsx": "Displays countdown or Proposal Day message using a custom hook.",
  "frontend/src/components/romance/EasterEggHeart.tsx": "Interactive heart that opens a full-screen modal revealing a secret message.",
  "frontend/src/components/romance/MusicProvider.tsx": "Context managing background music playback, autoplay retries, and user preference persistence.",
  "frontend/src/components/romance/MusicToggle.tsx": "Button to toggle music state, switching icons based on playback.",
  "frontend/src/components/romance/Overlays.tsx": "Renders decorative rose-petal and glowing-heart background overlays.",
  "frontend/src/components/romance/RomanticLayout.tsx": "Global layout with watermark, overlays, music toggle, countdown, routed content, and footer.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and refreshes a backend actor based on Internet Identity state and invalidates dependent queries.",
  "frontend/src/hooks/useCountdown.ts": "A React hook that calculates remaining time until a target date and updates every minute, returning days, hours, minutes, seconds, and expiration status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Tailwind-based global styles defining a romantic color palette, typography utilities, glow effects, and animations.",
  "frontend/src/main.tsx": "App entry point that mounts React, wrapping the application with React Query and the Internet Identity provider.",
  "frontend/src/pages/FeelMyLove.tsx": "Interactive page with heart animations that reveals a romantic message and navigation after timed effects.",
  "frontend/src/pages/Forever.tsx": "A sentimental page with animations and text expressing long-term love and commitment.",
  "frontend/src/pages/Home.tsx": "Landing page with animated romantic visuals introducing the experience and linking to the love story.",
  "frontend/src/pages/LoveLetter.tsx": "Page displaying a styled heartfelt love letter with a textured background and romantic typography.",
  "frontend/src/pages/OurStory.tsx": "React page rendering a timeline-style love story with animated milestone cards that fade in on scroll. Includes emotional text sections and decorative UI elements.",
  "frontend/src/pages/Proposal.tsx": "Proposal page showing timed text sequence and two possible celebration screens with animations, confetti, and themed visuals. Manages user responses to show different celebratory layouts.",
  "frontend/src/pages/WhyILoveYou.tsx": "Page displaying interactive heart flip cards, each revealing a reason for love when tapped. Includes animated backgrounds and a grid of cards with emoji fronts and text backs.",
  "frontend/tailwind.config.js": "Tailwind configuration extending custom colors, fonts, animations, shadows, and layout utilities. Enables plugins and defines a romantic-themed design system.",
  "project_state.json": "Project metadata describing the romantic proposal website, existing features, known issues, and versioning. Notes missing background music implementation and tracks feature requirements."
}