{
  "backend/main.mo": "Empty Motoko actor definition serving as backend placeholder.",
  "feature_evidence.json": "Metadata describing a feature request to update the final image on the /forever page and listing related files, components, and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend source files for reference in build planning.",
  "frontend/index.css": "Tailwind base stylesheet defining light and dark theme CSS variables and applying global background and text styles.",
  "frontend/index.html": "Base HTML file setting up the app root and preloading background music before loading the main React bundle.",
  "frontend/src/App.tsx": "Configures the React Router with all pages and wraps routing inside the MusicProvider.",
  "frontend/src/components/romance/CountdownTimer.tsx": "Displays a Proposal Day countdown or celebratory message using the useCountdown hook.",
  "frontend/src/components/romance/EasterEggHeart.tsx": "Interactive heart button that reveals a secret modal message when clicked.",
  "frontend/src/components/romance/MusicProvider.tsx": "Manages global background-music state, playback, and autoplay fallback via context.",
  "frontend/src/components/romance/MusicToggle.tsx": "Button UI for toggling background music using context state.",
  "frontend/src/components/romance/Overlays.tsx": "Renders drifting rose‑petal and glowing‑hearts background overlays using static assets.",
  "frontend/src/components/romance/RomanticLayout.tsx": "Shared layout adding watermark, overlays, music toggle, countdown timer, and footer around page content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCountdown.ts": "Hook calculating remaining time to a target date, updating once per minute.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth, including loading, login, logout, and status handling.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, romantic color palette, typography, glow effects, and custom animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/FeelMyLove.tsx": "Interactive romantic page with heart animations and a timed message reveal, leading to the proposal route.",
  "frontend/src/pages/Forever.tsx": "Final romantic page featuring heartfelt messages, animations, and imagery symbolizing long-term love.",
  "frontend/src/pages/Home.tsx": "Landing page with animated hearts, romantic intro text, and navigation to the love story route.",
  "frontend/src/pages/LoveLetter.tsx": "Displays a styled heartfelt letter with a textured paper background and romantic narrative content.",
  "frontend/src/pages/OurStory.tsx": "Implements a scroll‑animated milestone timeline with emotional text cards for the “Our Story” page.",
  "frontend/src/pages/Proposal.tsx": "Displays a timed text sequence leading to a proposal question and celebratory animations based on the user’s response.",
  "frontend/src/pages/WhyILoveYou.tsx": "Renders an interactive grid of heart‑flip cards showing reasons for love with animated backgrounds.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and extended utilities for the site’s romantic theme.",
  "project_state.json": "Stores project metadata, feature descriptions, known issues, and image requirements for the romantic proposal website."
}