{
  "backend/main.mo": "Defines an empty Motoko actor with no methods.",
  "feature_evidence.json": "Lists implemented features, associated files, components, test IDs, and confidence levels for project evidence tracking.",
  "frontend-file-summaries.txt": "Provides high-level descriptions of all frontend files and their roles in the app's structure, styling, and romantic features.",
  "frontend/index.css": "Sets Tailwind base layers and defines a comprehensive light/dark theme using CSS variables for colors and UI tokens.",
  "frontend/index.html": "Basic HTML entrypoint that preloads background music and mounts the React SPA.",
  "frontend/src/App.tsx": "Configures React Router routes for all pages and wraps them with MusicProvider and RomanticLayout.",
  "frontend/src/components/romance/CountdownTimer.tsx": "Displays a live countdown to Proposal Day or a celebratory message once the date arrives.",
  "frontend/src/components/romance/EasterEggHeart.tsx": "Interactive heart button that opens a modal revealing a secret romantic message.",
  "frontend/src/components/romance/MusicProvider.tsx": "Manages background music playback with autoplay handling, state syncing, and localStorage persistence.",
  "frontend/src/components/romance/MusicToggle.tsx": "Button that toggles background music on and off, reflecting current playback state.",
  "frontend/src/components/romance/Overlays.tsx": "Renders fixed decorative overlays of rose petals and glowing hearts with drift animations.",
  "frontend/src/components/romance/RomanticLayout.tsx": "Provides the global page layout with watermark, overlays, fixed UI controls, routed content, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useCountdown.ts": "Provides a React hook that calculates remaining time until a target date and updates it every minute.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for authentication using Dfinity AuthClient, exposing identity, login, and logout state.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom romantic-themed colors, utilities, fonts, shadows, and animations.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/FeelMyLove.tsx": "Displays an interactive romantic page with heart animations and timed messages, leading to the proposal page.",
  "frontend/src/pages/Forever.tsx": "Renders a final romantic message page with animations, heartfelt text, and themed images symbolizing lasting love.",
  "frontend/src/pages/Home.tsx": "Shows the homepage with animated backgrounds, floating hearts, and an introduction leading to the love story section.",
  "frontend/src/pages/LoveLetter.tsx": "Renders a decorative love letter page with styled background, heartfelt text, and animated elements.",
  "frontend/src/pages/OurStory.tsx": "Shows a milestone-based timeline of the couple’s story with animated cards and a themed backdrop.",
  "frontend/src/pages/Proposal.tsx": "Displays a timed proposal sequence with text reveals and celebratory animations based on user choice.",
  "frontend/src/pages/WhyILoveYou.tsx": "Provides interactive flip cards listing reasons for love, with animated hearts and a themed layout.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, fonts, animations, and plugin usage.",
  "project_state.json": "Stores the project’s current state, requirements, features, issues, and metadata for a romantic multi‑page proposal website. Highlights persistent background‑music problems and lists required visuals and implemented features."
}