{
  "kind": "build_request",
  "title": "Fix background music playback and add a final romantic image on the last page",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Make background music actually play across the entire experience (all routes) by ensuring the audio file exists at the exact path used by the app (/assets/music/background-music.mp3) and loads without 404s in production builds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Music nahi hua add & last me romantic pic chahiye"
        ]
      },
      "acceptanceCriteria": [
        "A real audio file is present in the frontend static assets at /assets/music/background-music.mp3 (served by the frontend, not the backend).",
        "Opening the deployed site and checking DevTools Network shows the music file request succeeds (no 404/failed requests).",
        "When the user turns music ON, the track can be heard and continues when navigating between pages (e.g., / -> /our-story -> /proposal)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Fix MusicProvider/MusicToggle behavior so that the music reliably starts after a user gesture (browser autoplay compliance) and the toggle always reflects the true playback state (playing vs paused), including after refresh when localStorage 'music-playing' is true.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Music nahi hua add & last me romantic pic chahiye"
        ]
      },
      "acceptanceCriteria": [
        "If localStorage('music-playing') is 'true' and autoplay is blocked, the next user gesture (click or keydown) starts playback successfully without requiring multiple attempts.",
        "The toggle icon/aria-label updates based on actual audio playback events (play/pause/ended) and remains consistent after route navigation.",
        "Toggling OFF pauses audio immediately and prevents any pending retry listener from starting playback again until toggled ON.",
        "Refreshing the page preserves the user preference and results in the expected behavior: (a) plays immediately if allowed, or (b) plays on the next user gesture if blocked."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add a romantic picture to the very end of the experience (the last page at /forever) as a prominent final visual, styled to match the existing romantic cinematic theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Music nahi hua add & last me romantic pic chahiye"
        ]
      },
      "acceptanceCriteria": [
        "A new romantic image asset is added under frontend/public/assets/generated and is displayed on the /forever page near the bottom as the closing visual.",
        "The image is responsive (looks good on mobile and desktop), does not overflow the viewport, and includes meaningful alt text in English.",
        "The image loads without errors (no 404) and matches the site’s existing soft-glow romantic aesthetic."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (immutable paths).",
    "Do not route images or audio through the backend; serve them as static frontend assets.",
    "Backend must remain a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Adding new authentication methods beyond existing Internet Identity support.",
    "Adding real-time features (WebSockets/chat/push notifications).",
    "Changing the overall page flow/routes beyond adding the final image to the existing last page."
  ],
  "imageRequirements": {
    "required": [
      "Romantic couple silhouette at sunset with soft bokeh hearts, cinematic lighting, warm blush/champagne palette (final-romantic-scene.dim_1920x1080.png)"
    ],
    "edits": []
  }
}